Revit 2027 API
RebarSpliceOptions Properties
The RebarSpliceOptions type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SplicePosition |  Identifies the splice line position.
SpliceTypeId |  Identifies the id of the Rebar Splice Type.
Top
See Also
Reference
RebarSpliceOptions Class
Autodesk.Revit.DB.Structure Namespace